{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "Document Name",
    "2": "Parties",
    "3": "Agreement Date",
    "4": "Effective Date",
    "5": "Expiration Date",
    "6": "Renewal Term",
    "7": "Notice to Terminate Renewal",
    "8": "Governing Law",
    "9": "Most Favored Nation",
    "10": "Non-Compete",
    "11": "Exclusivity",
    "12": "No-Solicit of Customers",
    "13": "Competitive Restriction Exception",
    "14": "No-Solicit of Employees",
    "15": "Non-Disparagement",
    "16": "Termination for Convenience",
    "17": "Right of First Refusal, Offer or Negotiation (ROFR/ROFO/ROFN)",
    "18": "Change of Control",
    "19": "Anti-Assignment",
    "20": "Revenue/Profit Sharing",
    "21": "Price Restriction",
    "22": "Minimum Commitment",
    "23": "Volume Restriction",
    "24": "IP Ownership Assignment",
    "25": "Joint IP Ownership",
    "26": "License Grant",
    "27": "Non-Transferable License",
    "28": "Affiliate IP License-Licensor",
    "29": "Affiliate IP License-Licensee",
    "30": "Unlimited/All-You-Can-Eat License",
    "31": "Irrevocable or Perpetual License",
    "32": "Source Code Escrow",
    "33": "Post-Termination Services",
    "34": "Audit Rights",
    "35": "Uncapped Liability",
    "36": "Cap on Liability",
    "37": "Liquidated Damages",
    "38": "Warranty Duration",
    "39": "Insurance",
    "40": "Covenant not to Sue",
    "41": "Third Party Beneficiary"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Affiliate IP License-Licensee": 29,
    "Affiliate IP License-Licensor": 28,
    "Agreement Date": 3,
    "Anti-Assignment": 19,
    "Audit Rights": 34,
    "Cap on Liability": 36,
    "Change of Control": 18,
    "Competitive Restriction Exception": 13,
    "Covenant not to Sue": 40,
    "Document Name": 1,
    "Effective Date": 4,
    "Exclusivity": 11,
    "Expiration Date": 5,
    "Governing Law": 8,
    "IP Ownership Assignment": 24,
    "Insurance": 39,
    "Irrevocable or Perpetual License": 31,
    "Joint IP Ownership": 25,
    "License Grant": 26,
    "Liquidated Damages": 37,
    "Minimum Commitment": 22,
    "Most Favored Nation": 9,
    "No-Solicit of Customers": 12,
    "No-Solicit of Employees": 14,
    "Non-Compete": 10,
    "Non-Disparagement": 15,
    "Non-Transferable License": 27,
    "Notice to Terminate Renewal": 7,
    "O": 0,
    "Parties": 2,
    "Post-Termination Services": 33,
    "Price Restriction": 21,
    "Renewal Term": 6,
    "Revenue/Profit Sharing": 20,
    "Right of First Refusal, Offer or Negotiation (ROFR/ROFO/ROFN)": 17,
    "Source Code Escrow": 32,
    "Termination for Convenience": 16,
    "Third Party Beneficiary": 41,
    "Uncapped Liability": 35,
    "Unlimited/All-You-Can-Eat License": 30,
    "Volume Restriction": 23,
    "Warranty Duration": 38
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
